<?php 
require '../database/Db.class.php'; //Κλήση του απαραίτητου για την σύνδεση με τη βάση δεδομένων και την εκτέλεση ερωτημάτων αρχείου κλάσης Db.class.php

$db = new Db();

$id = $_GET['id']; //Αποθήκευση στη μεταβλητή $id τα περιεχόμενα του "id" που αποστέλλεται μέσω της μεθόδου "GET" στο url     

if ($db->delete_booking($id)) { //Αν εκτελεστεί η function τότε γίνεται ανακατεύθυνση στη συγκεκριμένη διεύθυνση, αλλιώς εμφανίζεται μήνυμα σφάλματος
    header('Location: ../admin/bookings.php');
    exit;
} 
?>